cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'liamg/tfsec'

brew 'zsh'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'prettyping'

cask 'iterm2'
cask 'dashlane'
cask 'little-snitch'
cask 'tunnelblick'
cask 'aws-vpn-client'
cask 'authy'
cask 'jetbrains-toolbox'
cask 'google-chrome'
cask 'spotify'
cask 'zoomus'
cask 'microsoft-teams'
cask 'slack'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'karabiner-elements'
cask 'mos'

brew 'jq'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'roundup'
brew 'unrar'
brew 'wget'
brew 'hub'
brew 'fzf'
brew  'hydra'
brew  'john'
brew  'socat'
brew  'sqlmap'
brew  'tcpflow'
brew  'tcpreplay'
brew  'tcptrace'
brew  'ucspi-tcp' # `tcpserver` etc.
brew  'xz'
brew 'nmap'
brew 'openssh'
brew 'tree'
brew 'tmux'
brew 'pandoc'
brew 'python@3.8'

#  'other useful binaries.
brew  'ack'
brew  'dark-mode'
#brew  'exiv2'
brew  'git'
brew  'git-lfs'
brew  'oath-toolkit'
brew  'httpie'
brew 'adr-tools'
brew 'parallel'


#Docker
cask 'docker'

#k8s
brew 'kubernetes-cli'
brew 'kubernetes-helm'

#MS tooling
cask 'dotnet-sdk'
cask 'powershell'
brew 'azure-cli'

brew 'terraform'
brew 'awscli'
brew 'pre-commit'
brew 'liamg/tfsec/tfsec'
brew 'tflint'

cask 'adobe-creative-cloud'

