cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

brew  'aircrack-ng'
brew  'binutils'
brew  'binwalk'
brew  'cifer'
brew  'dex2jar'
brew  'dns2tcp'
brew  'fcrackzip'
brew  'foremost'
brew  'hashpump'
brew  'hydra'
brew  'john'
brew  'knock'
brew  'netpbm'
brew  'nmap'
brew  'pngcheck'
brew  'socat'
brew  'sqlmap'
brew  'tcpflow'
brew  'tcpreplay'
brew  'tcptrace'
brew  'ucspi-tcp' # `tcpserver` etc.
brew  'xz'

#  'other useful binaries.
brew  'ack'
brew  'dark-mode'
#brew  'exiv2'
brew  'git'
brew  'git-lfs'
brew  'oath-toolkit'
brew  'httpie'



brew  'terraform'
brew  'packer'
brew  'consul'
brew  'azure-cli'

